/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_calloc.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pskip <pskip@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/11 17:34:18 by pskip             #+#    #+#             */
/*   Updated: 2021/10/16 19:00:01 by pskip            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	*ft_calloc(size_t num, size_t size)
// Выделяет массив в памяти и инициализирует его элементы значением 0
{
	void	*str;

	str = malloc(num * size);
	if (str)
		ft_bzero(str, (num * size));
	return (str);
}
