/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strdup.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pskip <pskip@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/11 17:35:47 by pskip             #+#    #+#             */
/*   Updated: 2021/10/16 19:04:10 by pskip            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

char	*ft_strdup(const char *str)
/*Функция strdup() путем обращения к функции malloc() выделяет память,
 достаточную для хранения дубликата строки, на которую указывает str,
а затем производит копирование этой строки в выделенную область и возвращает 
указатель на нее.*/
{
	size_t	i;
	size_t	lens;
	char	*strnew;

	i = 0;
	lens = ft_strlen(str) + 1;
	strnew = (char *)malloc(lens);
	if (strnew)
	{
		while (i < lens)
		{
			strnew[i] = str[i];
			i++;
		}
	}
	return (strnew);
}
